Revit 2026 API

# MullionBreakMullion Method

---

This method is used to break the current Mullion at ends with its neighboring mullions.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void BreakMullion()
```
```vb
Public Sub BreakMullion
```
```cpp
public:
void BreakMullion()
```
```fsharp
member BreakMullion : unit -> unit
```

The mullions being perpendicular to it will be joined accordingly.

#### Reference

Mullion Class

Autodesk.Revit.DB Namespace